{
    "dictionary": [
        {
            "term": "Babe",
            "definition": "An attractive woman. Also a cute pig that is clever enough to pass as attractive."
        },
        {
            "term": "Baby Daddy/Momma",
            "definition": "The unwed parent of a bastard."
        },
        {
            "term": "Bachelor's Tuxedo",
            "definition": "Condom."
        },
        {
            "term": "Backdoor Man",
            "definition": "1. A secret lover who sneaks in the backdoor to avoid detection. 2. A man who prefers anal sex. 3. A gay man."
        },
        {
            "term": "Backseat Driver",
            "definition": "A top who tells the bottom what to do sexually while penetrating the bottom from behind."
        },
        {
            "term": "Bacon Strips",
            "definition": "1. A meaty vagina, characterized by a loose labia minora that appears stretched out from excessive use. 2. Shit stains left on underwear. Synonyms: beef curtains."
        },
        {
            "term": "Bacterial Vaginosis, BV",
            "definition": "The vaginal version of halitosis, caused by an imbalance of the growth of harmful bacteria versus protective bacteria in the vagina."
        },
        {
            "term": "Ball Buster",
            "definition": "A person who metaphorically pounds your balls with unnecessary nagging, teasing, joking, or harassing."
        },
        {
            "term": "Ball Busting",
            "definition": "A fetishistic act in which a man enjoys being kicked, kneed, or otherwise pounded in the balls."
        },
        {
            "term": "Ball Gag, Gag",
            "definition": "A mouth gag in which a ball-like object is tied into a person's mouth to prevent them from speaking or screaming."
        },
        {
            "term": "Ball Game",
            "definition": "A sport in which men try to trick others into looking at their exposed scrotum, which is often manipulated to appear in a variety of shapes."
        },
        {
            "term": "Balling on a Budget",
            "definition": "A high art in which a man seduces women without the aide of a healthy bank account."
        },
        {
            "term": "Balloon Knot",
            "definition": "An asshole, as it resembles the clinched rubber around a balloon’s knot."
        },
        {
            "term": "Balls Deep",
            "definition": "Fully committed, as when a man penetrates an orifice as far as he can go. Antonym: just the tip."
        },
        {
            "term": "Balls Out",
            "definition": "To fully commit and exert tremendous energy to complete a task."
        }
    ]
}