{
    "dictionary": [
        {
            "term": "Eager Beaver",
            "definition": "1. A horny woman. 2. The appendage sticking off the shaft of some vibrators, providing clitoral stimulation. Some are shaped like the tail of a beaver or like rabbit ears. The name of vibrators with such a feature."
        },
        {
            "term": "Earmuffs",
            "definition": "When a woman’s thighs are wrapped around a man’s ears during cunnilingus."
        },
        {
            "term": "Earn One’s Redwings",
            "definition": "The bloody badge of honor a man wears on his upper lip after performing cunnilingus on a menstruating woman."
        },
        {
            "term": "Eat Out",
            "definition": "Cunnilingus."
        },
        {
            "term": "Ecouteurism",
            "definition": "A fetish for eavesdropping on others having sex."
        },
        {
            "term": "Ecstasy",
            "definition": "1. A state of rapture, often used to describe the moment one reaches sexual climax. 2. The name of the recreational street drug MDMA, which induces a euphoric state."
        },
        {
            "term": "Effie",
            "definition": "An effeminate homosexual man."
        },
        {
            "term": "Eiffel Tower",
            "definition": "During a devil’s threesome when the man penetrating the woman doggy style and the man receiving fellatio high-five each other."
        },
        {
            "term": "Ejaculate",
            "definition": "Synonyms: big bang, blow your load, bust your nut, cream, cum, drop your load, fire a shot, get off, get your rocks off, number three, nut, pop a nut, shoot, shoot your wad, spill one's seed, squirt."
        },
        {
            "term": "Electra Complex",
            "definition": "A daughter's quasi-sexual competition with her mother for her father's affection. The female version of the Oedipus complex. Origins: Carl Jung."
        },
        {
            "term": "Electric Chair",
            "definition": "When a partner is bound to a chair while receiving electro-stimulation."
        },
        {
            "term": "Electrophilia",
            "definition": "A fetish for electricity, which usually involves electro-stimulation."
        },
        {
            "term": "Electro-Stimulation",
            "definition": "Electric stimulation, particularly on the genitals and erogenous zones."
        },
        {
            "term": "Emetophilia",
            "definition": "A fetish for vomiting or watching others vomit, particularly after gagging during fellatio."
        },
        {
            "term": "Emotional Dump",
            "definition": "Unloading all of your emotional baggage on a friend or on a social networking website like Facebook."
        }

    ]
}
