{
    "dictionary": [
        {
            "term": "ABC party",
            "definition": "“Anything but clothes” theme party in which guests can come naked or draped in non-traditional coverups, such as duct tape, boxes, newspaper."
        },
        {
            "term": "ABC Sex",
            "definition": "In a long-term relationship when a couple only has sex on anniversaries, birthdays, and Christmas."
        },
        {
            "term": "Ablutophilia",
            "definition": "Fetish for baths or showers that usually centers around a naked person lathering themselves up."
        },
        {
            "term": "ABR",
            "definition": "\"Adult breast feeding.\" The abbreviation is mainly used in the fetish world and in fetish porn."
        },
        {
            "term": "Accident",
            "definition": "A pregnancy that was not planned by at least one member of a couple."
        },
        {
            "term": "Acomoclitic",
            "definition": "A fetish for hairless genitals. Similar to: gynelophilous, hirsutophilia, hyphephilia, pubephilia, trichophilia."
        },
        {
            "term": "Acorn",
            "definition": "1. The head of a penis. 2. A small penis."
        },
        {
            "term": "Acrophilia",
            "definition": "A fetish for having sex in high places such as on mountains or rooftops. Some members of the mile high club have this fetish."
        },
        {
            "term": "Acrotomophilia",
            "definition": "A fetish for amputees and their shortened limbs."
        },
        {
            "term": "Acucullophilia",
            "definition": "A fetish, or preference, for circumcised men."
        },
        {
            "term": "Acousticophilia",
            "definition": "A fetish involving sounds. This can include such things as being aroused by music or a partner's moaning."
        },
        {
            "term": "Actirasty",
            "definition": "A fetish for sun exposure. This is often a fetish of tanorexics, fans of outdoor sex, or those who only date really tan people."
        },
        {
            "term": "Adolescentilism",
            "definition": "A fetish for acting, dressing, or being treated like an adolescent."
        },
        {
            "term": "Adult Book/Toy Store",
            "definition": "Sex shop."
        },
        {
            "term": "Aftermath",
            "definition": "Postcoital cuddling."
        }
    ]
}
