{
  "DirtyDictionary": {
    "A": [
    "Term": "ABC party",
    "Definition": "“Anything but clothes” theme party in which guests can come naked or draped in non-traditional coverups, such as duct tape, boxes, newspaper…"
  },
  {
    "Term": "ABC Sex",
    "Definition": "In a long-term relationship when a couple only has sex on anniversaries, birthdays, and Christmas."
  },
  {
    "Term": "Ablutophilia",
    "Definition": "Fetish for baths or showers that usually centers around a naked person lathering themselves up."
  },
  {
    "Term": "ABR",
    "Definition": "\"Adult breast feeding.\" The abbreviation is mainly used in the fetish world and infetish porn."
  },
  {
    "Term": "Accident",
    "Definition": "A pregnancy that was not planned by at least one member of a couple."
  },
  {
    "Term": "Acomoclitic",
    "Definition": "A fetish for hairless genitals. Similar to: gynelophilous, hirsutophilia, hyphephilia, pubephilia, trichophilia."
  },
  {
    "Term": "Acorn",
    "Definition": "1. The head of a penis. 2. A small penis."
  },
  {
    "Term": "Acrophilia",
    "Definition": "A fetish for having sex in high places such as on mountains or rooftops. Some members of the mile high club have this fetish."
  },
  {
    "Term": "Acrotomophilia",
    "Definition": "A fetish for amputees and their shortened limbs."
  },
  {
    "Term": "Acucullophilia",
    "Definition": "A fetish, or preference, for circumcised men."
  },
  {
    "Term": "Acousticophilia",
    "Definition": "A fetish involving sounds. This can include such things as being aroused by music or a partner's moaning."
  },
  {
    "Term": "Actirasty",
    "Definition": "A fetish for sun exposure. This is often a fetish of tanorexics, fans of outdoor sex, or those who only date really tan people."
  },
  {
    "Term": "Adolescentilism",
    "Definition": "A fetish for acting, dressing, or being treated like an adolescent."
  },
  {
    "Term": "Adult Book/Toy Store",
    "Definition": "Sex shop."
  },
  {
    "Term": "Aftermath",
    "Definition": "Postcoital cuddling."
  },
  {
    "Term": "Agalmatophilia",
    "Definition": "A fetish for a human-like doll, mannequin, or statue. This does not include the use of sex dolls merely as surrogates for real partners. Similar to pygmalionism."
  },
  {
    "Term": "Age Play",
    "Definition": "A type of fetishistic role-playing in which people pretend to be substantially older or younger than they are. Includes fetishes like adolescentilism and infantilism."
  },
  {
    "Term": "Agnosexual",
    "Definition": "A person who has yet to decide on how to categorize his sexuality."
  },
  {
    "Term": "Agonophiliac",
    "Definition": "A fetish for violence or fighting as foreplay. Men with this fetish are often fans of pornographic scenes that feature wrestling or rough sex."
  },
  {
    "Term": "Agoraphilia",
    "Definition": "A fetish for sex in public places. People with this fetish are often exhibitionists or people who get aroused by the thrill of potentially getting caught."
  },
  {
    "Term": "Agrexophilia",
    "Definition": "A fetish for having other people know about your sexual activities. This can include people with agoraphilia, those who like to have loud sex, exhibitionists, people who like to put their homemade sex tapes online, or those who simply like to brag about their conquests."
  },
  {
    "Term": "Air Inflation",
    "Definition": "One of the most common types of inflation fetish. This usually involves the fantasy of inflating a person with a bicycle pump to a comically large size. Some practitioners of this fetish enjoy pumping air into their partner's anus to create a bulging belly and a feeling of fullness, though this practice is not without risk."
  },
  {
    "Term": "Airplane Blonde",
    "Definition": "A woman who dyes her hair blonde but who still has a “black box.”"
  },
  {
    "Term": "Airtight",
    "Definition": "When a woman is simultaneously penetrated by penises in her mouth, vagina, and anus."
  },
  {
    "Term": "Alarm Clock",
    "Definition": "A partner who wakes you up for morning sex."
  },
  {
    "Term": "Algolagnia",
    "Definition": "A fetish for pain."
  },
  {
    "Term": "Allorgasmia",
    "Definition": "A fetish for fantasizing about someone other than your current partner. A common fetish among married couples."
  },
  {
    "Term": "Allotriorasty",
    "Definition": "A fetish for sex partners of another race, ethnicity, or nationality. This is common among women who are attracted to accents. This fetish is likely connected to the need to keep a community's gene pool diverse."
  },
  {
    "Term": "Alpha Male",
    "Definition": "A dominant male. A leader of a group of males who generally has first choice when it comes to selecting potential mates from a group of females. In younger males, dominance is often related to physical dominance or an aggressive personality. In older men, dominance is expressed in terms of wealth, power, and control. Synonyms: big dicker, stud."
  },
  {
    "Term": "Alphmegamia",
    "Definition": "A fetish for older men. This is a common fetish among women as mate selection for females is less impacted by the age of a potential mate than by his status."
  },
  {
    "Term": "Alprostadil",
    "Definition": "A vasodilator used to treat erectile dysfunction."
  },
  {
    "Term": "Altocalciphilia",
    "Definition": "A fetish for high heels. Common among those with a foot fetish. Synonyms: retifism."
  },
  {
    "Term": "Alvinolagnia",
    "Definition": "A fetish for stomachs. Likely linked to the importance of wide hips when it comes to natural childbirth. Synonyms: partialism."
  },
  {
    "Term": "Amaurophilia",
    "Definition": "A fetish for not being seen during sex. This usually involves turning off the lights or blindfolding a partner. Some peeping toms and fans of glory holes have this fetish."
  },
  {
    "Term": "Ambisextrous",
    "Definition": "A person for whom the term “bisexual” is too constricting. Synonyms: agnosexual, happy shopper, trisexual."
  },
  {
    "Term": "Anaclitism",
    "Definition": "An erotic fixation on the objects one was exposed to as an infant, such as anal thermometers, bibs, bottles, pacifiers. Similar to: autonepiophilia, infantilism."
  },
  {
    "Term": "Anal Beads",
    "Definition": "A class of sex toy consisting of balls of various sizes strung together on a string or a flexible rod. Pleasure is not as much derived from the insertion of these beads, as from their extraction. Despite how tempting it may be, anal beads should not be ripped out with the same enthusiasm with which one yanks the cord of a lawnmower. Synonyms: Chinese/Oriental love beads, string of pearls, siamese strings."
  },
  {
    "Term": "Anal Bleaching",
    "Definition": "A cosmetic procedure in which chemicals or lasers are used to lighten the darker skin around the anus in order to make it match the lighter skin of the buttock. The process originated with female porn performers before seeping into mainstream populations in the early 2000s with the rise of free, online porn."
  },
  {
    "Term": "Analingus",
    "Definition": "Oral sex performed on the anus. Synonyms: ass blow, blow some ass, clean the kitchen, lick the fudge bowl, lick the jar/bowl clean, rim job, rimming, suck asshole, sugar bowl pie, toss the salad."
  },
  {
    "Term": "Anal Sex",
    "Definition": "ass fuck, ass sex, brown holing, bugger, bum fuck, butt bang, butt fuck, corn holing, digging a ditch, dipping a finger in the fudge, DNA (dick in ass), fishing for mudfish, fourth base, fudge packing, going down the dirt road, Greeking, hump the dump, lube the tube, making pound cake, packing fudge, pack the poop chute, painal, plan B, popping it in the toaster, pumper in the dumper, pushing shit uphill, ram job, ream, rectify, rump raid, saddle up, shit fuck, stir fudge, third way, traveling the Hershey Highway, using the servant's entrance..."
  },
  {
    "Term": "Anal/Ass Sphincter",
    "Definition": "Two muscles consisting of an outer and inner sphincter that keep the anus closed. These are the muscles that must be relaxed during anal sex. These are also the muscles that must be surgically repaired after extreme anal play."
  },
  {
    "Term": "Anaphrodisiac",
    "Definition": "A substance that reduces one's sexual appetite. The opposite of an aphrodisiac."
  },
  {
    "Term": "Anasteemaphilia",
    "Definition": "A fetish for partners who are much shorter or taller."
  },
  {
    "Term": "Anchor Baby",
    "Definition": "The child born in the US to immigrant parents who hope the child's American status will help win them citizenship. The term can also refer to a pregnancy that anchors a couple together, or guarantees one of the parents a substantial child support payment each month."
  },
  {
    "Term": "Androgynous",
    "Definition": "Characterized by both male and female attributes. Sexless."
  },
  {
    "Term": "Androidism",
    "Definition": "A fetish for humanoid robots. Similar to agalmatophilia and Pygmalionism."
  },
  {
    "Term": "Andromimetophilia",
    "Definition": "When a woman is sexually aroused by dressing, acting, or being treated like a man."
  },
  {
    "Term": "Angry Dragon",
    "Definition": "An absurd sex act in which you smack the back of your sex partner’s head right after ejaculating in her mouth. This causes semen to erupt from her nostrils while she roars like an irate, fire-breathing monster."
  },
  {
    "Term": "Angry Pirate",
    "Definition": "An absurd sex act in which you ejaculate in your sex partner’s eye then kick her in the shin. This causes her to hobble around on one leg with one eye covered while grunting and cursing like a sailor."
  },
  {
    "Term": "Animism",
    "Definition": "A belief that objects or animals have spirits and that humans can connect with these spirits, often in sexual ways. Synonyms: objectiphile, objectum sexual."
  },
  {
    "Term": "Anophelorastia",
    "Definition": "A fetish for ravaging a partner. People with this fetish are often fans of extremely rough porn."
  },
  {
    "Term": "Anorgasmic",
    "Definition": "A sexual dysfunction in which a person cannot reach sexual climax. More common in females."
  },
  {
    "Term": "Antholagnia",
    "Definition": "A fetish for the scent or sight of flowers."
  },
  {
    "Term": "Aphephilia",
    "Definition": "A fetish for human touch."
  },
  {
    "Term": "Apistia",
    "Definition": "Married and unfaithful. Origins: The Greek New Testament."
  },
  {
    "Term": "Apolaustic",
    "Definition": "One who is devoted to enjoyment or pleasure. Hedonistic."
  },
  {
    "Term": "Apotemnophilia",
    "Definition": "A fetish for having your own limbs amputated."
  },
  {
    "Term": "Aquaophilia",
    "Definition": "A fetish for water that goes far beyond enjoying sex on the beach or in a hot tub."
  },
  {
    "Term": "Arabian Goggles",
    "Definition": "When testicles are draped over someone's eyes."
  },
  {
    "Term": "Archnephilia",
    "Definition": "A fetish for spiders."
  },
  {
    "Term": "Areola",
    "Definition": "The pigmented ring of skin surrounding the nipple’s raised center."
  },
  {
    "Term": "Arm Candy",
    "Definition": "A person who is dated for her superficial beauty as opposed to her substance. Arm candy is most often a status symbol employed by older bachelors to demonstrate their prowess."
  },
  {
    "Term": "Around the World",
    "Definition": "When the woman spins 360 degrees atop her partner while maintaining penetration. Ideally this is performed in one motion."
  },
  {
    "Term": "Arousal",
    "Definition": "Sexual excitement."
  },
  {
    "Term": "Asiaphile",
    "Definition": "A fetish for Asians."
  },
  {
    "Term": "ASLs",
    "Definition": "“Anus shaped lips,” or \"ass sucking lips.\" Lips that resemble the puckered skin of an asshole. Similar to DSLs."
  },
  {
    "Term": "Asphyxiophilia",
    "Definition": "A fetish for being suffocated or choked."
  },
  {
    "Term": "Ass",
    "Definition": "1. arse, backend, backside, backyard, behind, booty, bottom, bum, bumper, buns, butt, buttocks, caboose, can, candy apples, cheeks, culo, derriere, fanny, junk in the trunk, heinie, hindquarters, moon, keister, posterior, rear, rear end, rump, stern, seat, tail, tail end, tooshie, trunk, tush, yeasty buns... 2. An idiot who is not quite as offensive as an asshole. 3. Sex. Usage: \"to get some ass.\""
  },
  {
    "Term": "Ass Bandit/Pirate",
    "Definition": "A man who coerces other men, particularly heterosexual men, into having anal sex."
  },
  {
    "Term": "Ass Banger/Jabber",
    "Definition": "A gay man."
  },
  {
    "Term": "Asshole",
    "Definition": "1. a hole, arsehole, back burner, backdoor, backdoor trumpet, balloon knot, black hole, blind eye, brown eye, bungalow, bunghole, butt hole, button, chocolate speedway/starfish, corn hole, dingus, dirt pipe/road, dugout, duster, fudge factory, fudge tunnel, Grand Canyon, Hershey highway, hole a, leather Cheerio, man pussy, nature's birth control, plan b, poop chute, pooper, porthole, pucker, round eye, rusty bullet hole, servant's entrance, shit hole/pipe, shitter, skunk hole, slot B, spunk bucket, starfish, stank tank, stink, stink hole, tailpipe, Whale Eye, windmill, windward passage, zero, ... 2. A person who metaphorically shits on others."
  },
  {
    "Term": "Ass Job",
    "Definition": "When a man rubs his penis between a set of ass cheeks. Like titty fucking, but with an ass and no penetration. Synonyms: cock dog, frottage, outercourse, the Princeton Rub, The Cardinal George."
  },
  {
    "Term": "Ass Licker, Ass Muncher",
    "Definition": "1. One who enjoys giving analingus. 2. A kiss ass."
  },
  {
    "Term": "Ass Play",
    "Definition": "Any type of sexual activity involving the ass."
  },
  {
    "Term": "Ass Quake",
    "Definition": "1. A bouncing ass substantial enough to shake the floor. Often used to praise a thick dancer's skills. 2. Vigorous sex that shakes the bed, the floor, and/or the walls. Origins: Big Sean in the song, “Mercy”."
  },
  {
    "Term": "Ass State",
    "Definition": "An estate of ass. A piece of property paid for by sex appeal. Often refers to the home of a model, stripper, or porn star. Origins: Big Sean in the song, “Mercy.”"
  },
  {
    "Term": "Ass Tray",
    "Definition": "An ass large enough to serve as a tray for rolling weed or snorting lines of cocaine. Origins: Big Sean in the song, “Mercy.”"
  },
  {
    "Term": "Ass-to-Ass",
    "Definition": "When two people simultaneously penetrate each other’s asses, usually with a double-sided dildo. Origins: The act was made famous when performed by Jennifer Connelly’s character in Requiem for a Dream."
  },
  {
    "Term": "Ass-to-Mouth, ATM",
    "Definition": "When a phallus transitions directly from anal to oral sex."
  },
  {
    "Term": "Asstronaut, Arstronaut",
    "Definition": "The first person to have anal sex with an anal virgin."
  },
  {
    "Term": "Asthenolagnia",
    "Definition": "A fetish for weakness or being humiliated."
  },
  {
    "Term": "Aunt",
    "Definition": "Madame who runs a brothel. Synonym: pimp."
  },
  {
    "Term": "Australian Kiss",
    "Definition": "Like a French kiss but performed down-under."
  },
  {
    "Term": "Autagonistophilia",
    "Definition": "A fetish for having others spy on you, particularly while naked or engaging in sexual acts. As opposed to exhibitionists who get off on exposing themselves to unsuspecting victims, a person with this fetish creates situations in which other people may see her naked, like sunbathing nude or changing in front of an open window."
  },
  {
    "Term": "Autassassinophilia",
    "Definition": "A fetish for coming close to death, particularly during sex."
  },
  {
    "Term": "Autoandrophilia",
    "Definition": "A fetish for women who dress, behave, or look like men."
  },
  {
    "Term": "Autoerotic",
    "Definition": "Masturbation."
  },
  {
    "Term": "Autoerotic Asphyxiation",
    "Definition": "Choking yourself while masturbating to achieve a more intense orgasm. This often involves the use of belts or ropes. People who have died from this form of masturbation include kung-fu master David Carradine and INXS rocker Michael Hutchence."
  },
  {
    "Term": "Auto-Fellatio",
    "Definition": "When a man performs oral sex on himself. This requires a large penis, extreme flexibility, or a combination of both. Ron Jeremy notoriously performed auto-fellatio in a few 1970s pornos."
  },
  {
    "Term": "Autogynephilia",
    "Definition": "A fetish in which a man derives sexual pleasure from imagining himself as a woman. This is a common fetish for cross dressers. Origins: coined by Ray Blanchard."
  },
  {
    "Term": "Autonepiophilia",
    "Definition": "A fetish for acting, dressing, and being treated like an infant. Synonym: anaclitism, infantilism."
  },
  {
    "Term": "Avisodomy",
    "Definition": "A form of bestiality involving sex with a bird."
  },
  {
    "Term": "Axillism",
    "Definition": "A fetish for armpits."
      }
    ]
  }
}
