{
    "dictionary": [
  {
    "Term": "Babe",
    "Definition": "An attractive woman. Also a cute pig that is clever enough to pass as attractive."
  },
  {
    "Term": "Baby Daddy/Momma",
    "Definition": "The unwed parent of a bastard."
  },
  {
    "Term": "Bachelor's Tuxedo",
    "Definition": "Condom."
  },
  {
    "Term": "Backdoor Man",
    "Definition": "1. A secret lover who sneaks in the backdoor to avoid detection. 2. A man who prefers anal sex. 3. A gay man."
  },
  {
    "Term": "Backseat Driver",
    "Definition": "A top who tells the bottom what to do sexually while penetrating the bottom from behind."
  },
  {
    "Term": "Bacon Strips",
    "Definition": "1. A meaty vagina, characterized by a loose labia minora that appears stretched out from excessive use. 2. Shit stains left on underwear. Synonyms: beef curtains."
  },
  {
    "Term": "Bacterial Vaginosis, BV",
    "Definition": "The vaginal version of halitosis, caused by an imbalance of the growth of harmful bacteria versus protective bacteria in the vagina. The condition is characterized by a thin, milky discharge with a fishy odor that can result from having a new sex partner, having multiple sex partners, stress, douching, and using an intrauterine device (IUD). While not considered an STD, it does spread like one between women."
  },
  {
    "Term": "Ball Buster",
    "Definition": "A person who metaphorically pounds your balls with unnecessary nagging, teasing, joking, or harassing."
  },
  {
    "Term": "Ball Busting",
    "Definition": "A fetishistic act in which a man enjoys being kicked, kneed, or otherwise pounded in the balls. In its extreme form, some men get their balls busted by hammers, high heels, or paddles. Some straight men with this fetish prefer to get their balls busted by other straight men because it is more humiliating or because they think men can deliver more force. Synonyms: tamakeri."
  },
  {
    "Term": "Ball Gag, Gag",
    "Definition": "A mouth gag in which a ball-like object is tied into a person's mouth to prevent them from speaking or screaming. Many ball gags come with a hole in the center to facilitate breathing. A common sex toy in BDSM play."
  },
  {
    "Term": "Ball Game",
    "Definition": "A sport in which men try to trick others into looking at their exposed scrotum, which is often manipulated to appear in a variety of shapes. Common ball game moves include the bat wing and the goat. Origins: The movie Waiting."
  },
  {
    "Term": "Balling on a Budget",
    "Definition": "A high art in which a man seduces women without the aid of a healthy bank account."
  },
  {
    "Term": "Balloon Knot",
    "Definition": "An asshole, as it resembles the clinched rubber around a balloon’s knot."
  },
  {
    "Term": "Balls Deep",
    "Definition": "Fully committed, as when a man penetrates an orifice as far as he can go. Antonym: just the tip."
  },
  {
    "Term": "Balls Out",
    "Definition": "To fully commit and exert tremendous energy to complete a task."
  },
  {
    "Term": "Banana Hammock",
    "Definition": "Any type of flashy underpants that accentuate a man's bulge. Synonyms: bikini briefs, Brazilian briefs, fruit cup, grape smuggler, jock strap, nut huggers, plume smugglers, Speedo..."
  },
  {
    "Term": "Banging the Bongos",
    "Definition": "Spanking a partner's butt cheeks like a set of bongos during doggie style sex."
  },
  {
    "Term": "Bareback",
    "Definition": "Risky sex without a condom. Synonyms: apache."
  },
  {
    "Term": "Bareback Rodeo",
    "Definition": "An orgy in which no one wears condoms. A great way to permanently impair your health."
  },
  {
    "Term": "Barely Legal",
    "Definition": "A sex partner who is just over the legal age of consent. Also, a popular category in porn."
  },
  {
    "Term": "Barnacles",
    "Definition": "1. Pieces of toilet paper or excrement that cling to a person's asshole. Synonyms: chuffnuts, dingle berries, klingons. 2. An overzealous snuggler."
  },
  {
    "Term": "Barse",
    "Definition": "Perineum. The space between the genitals and the asshole."
  },
  {
    "Term": "Bathroom Denial",
    "Definition": "A type of denial play in which the dom refuses to let the sub urinate and/or defecate. Urination denial is popular as a few sexual nerves can be activated due to the pressure of a full bladder."
  },
  {
    "Term": "Bathykolpian",
    "Definition": "Deep-bosomed. Origins: From the ancient Greek words bathus, “deep,” and kolpos, “bosom.”"
  },
  {
    "Term": "Batting for Both Sides",
    "Definition": "Bisexual. Synonyms: switch hitter."
  },
  {
    "Term": "Batting for the Other Side/team",
    "Definition": "Homosexual."
  },
  {
    "Term": "Bat Wing",
    "Definition": "When a man stretches his scrotum out to resemble a bat's wing. A common move in the ball game."
  },
  {
    "Term": "Basket Weaving",
    "Definition": "When a man rearranges his genitals in attempt to make them fit more comfortably in a snug garment."
  },
  {
    "Term": "Bastard",
    "Definition": "1. A child that is born out of wedlock or who is abandoned by at least one parent. 2. An offensive person."
  },
  {
    "Term": "BBBJ",
    "Definition": "“Bareback blow job.”"
  },
  {
    "Term": "BBC",
    "Definition": "“Big black cock.” Used in personal ads and in porn."
  },
  {
    "Term": "BBW",
    "Definition": "“Big, beautiful woman.” Used in personal ads as a euphemism for fat."
  },
  {
    "Term": "BDSM",
    "Definition": "“Bondage, discipline, and sado-masochism.” A catchall term for fetish play."
  },
  {
    "Term": "Bear",
    "Definition": "A gay man who is large, hairy, and often as cuddly as a teddy bear."
  },
  {
    "Term": "Beard",
    "Definition": "A female companion who is used to conceal a man's homosexuality."
  },
  {
    "Term": "Beardo",
    "Definition": "A bearded weirdo."
  },
  {
    "Term": "Beat the Rug",
    "Definition": "Sex."
  },
  {
    "Term": "Bedfellow, Bedmate",
    "Definition": "One who shares a bed, though not necessarily in a sexual context."
  },
  {
    "Term": "Beef Bayonet/Hammer/Stick",
    "Definition": "Penis."
  },
  {
    "Term": "Beef Curtains",
    "Definition": "Droopy or hanging labia minora. Synonyms: bacon strips."
  },
  {
    "Term": "Beer Goggles",
    "Definition": "An alcohol-induced point of view, in which everyone appears more attractive. Among other things, alcohol impairs one's ability to judge the symmetry of a face, which plays an important role in attraction as a symmetrical face conveys superior genetics. Similar: queer goggles."
  },
  {
    "Term": "Bee Stings",
    "Definition": "Small breasts. Synonym: mosquito bites."
  },
  {
    "Term": "Bell",
    "Definition": "The head of the penis."
  },
  {
    "Term": "Belonephilia",
    "Definition": "A fetish for sharp objects such as knives, needles, or razors."
  },
  {
    "Term": "Bezness Boys",
    "Definition": "Male prostitutes in Maraco who hang around the beaches and service Western tourists. Synonyms: gigolo, himbo, man whore, midnight cowboy."
  },
  {
    "Term": "BFP",
    "Definition": "“Bound for pleasure.” A BDSM term."
  },
  {
    "Term": "Biastophilia",
    "Definition": "A sexual disorder in which arousal is derived from the thought or act of assaulting another, often in a sexual manner."
  },
  {
    "Term": "Bisecting the Triangle",
    "Definition": "Sex."
  },
  {
    "Term": "Bisexual",
    "Definition": "A person who is sexually attracted to both sexes. Synonyms: gay guy, happy shopper, playing for both sides/teams, switch hitter."
  },
  {
    "Term": "Bishop",
    "Definition": "A penis, particularly one belonging to a man who believes in the virtues of abstinence."
  },
  {
    "Term": "Bitch",
    "Definition": "A woman who is promiscuous, but not with you."
  },
  {
    "Term": "Bitch Slap",
    "Definition": "A slap, particularly one delivered to a hysterical man or woman. Synonyms: pimp slap."
  },
  {
    "Term": "Bitch Tits",
    "Definition": "A man’s chest that resembles that of an ugly woman’s. Often a result of obesity, steroids, a hormonal imbalance, or Klinefelter's Syndrome. Synonyms: man boobs, moobs."
  },
  {
    "Term": "Bleed",
    "Definition": "To menstruate."
  },
  {
    "Term": "Blessing",
    "Definition": "An allegedly accidental pregnancy that a woman decides to keep because, in addition to filling her with your devil seed, your penis also inspired her to find religion."
  },
  {
    "Term": "Bloody Vagina Belch",
    "Definition": "A queef while a woman is on her period."
  },
  {
    "Term": "Blow Job, Blowie, BJ",
    "Definition": "Fellatio."
  },
  {
    "Term": "Blue Balls",
    "Definition": "An irritable psychological state achieved when a man is aroused for an extended period of time without reaching an orgasm. Despite what some adolescent males believe, your balls do not actually turn blue."
  },
  {
    "Term": "Blue Waffle",
    "Definition": "A blue tinted and infected vagina, made popular by asshole friends convincing their buddies to google the term."
  },
  {
    "Term": "Blumpkin",
    "Definition": "Fellatio performed while a man is defecating. Often used in fetish play as a form of degradation."
  },
  {
    "Term": "Body Inflation",
    "Definition": "Being sexually aroused by the fantasy of physically expanding yourself, or others. This fetish often involves wearing inflation devices under your clothes or fat suits."
  },
  {
    "Term": "Boi",
    "Definition": "Often used in both lesbian and BDSM culture to denote a boyish but female-bodied person. Sometimes also refers to young gay men."
  },
  {
    "Term": "Bombshell, Blonde Bombshell",
    "Definition": "Before the term \"sex symbol\" was popularized, bombshell referred to sexual icons of American pop culture in the mid to late 1900s. Such women were often characterized as having hourglass figures, pronounced curves, large breasts, and the early ones were typically blonde. Ex: Marilyn Monroe is the quintessential Blonde Bombshell. Synonyms: Pin-up girl."
  },
  {
    "Term": "Bondage",
    "Definition": "Fetish play in which a submissive partner is physically restrained."
  },
  {
    "Term": "Bondage Babe",
    "Definition": "A woman dressed in fetish gear, including latex, fishnets, collars, or PVC. Often refers to a woman who is more into fetish as a fashion than a lifestyle, or a fetish model who only participates in fetishistic acts for pay."
  },
  {
    "Term": "Boner",
    "Definition": "Erection. An erect blood-filled penis brought on by sexual arousal. The average male gets 3 a night while sleeping. Also known as erection, stiffy, chubby, hard on that guy would stick his boner in anything with a hole."
  },
  {
    "Term": "Booty Call",
    "Definition": "1. Calling a fuck buddy for sex. Often occurs when the bars close and you have not found anyone else willing to have sex with you. 2. Your fuck buddy."
  },
  {
    "Term": "Bosom",
    "Definition": "Boobs."
  },
  {
    "Term": "Bosom Buddy",
    "Definition": "Friends who are so close that it is as though they breast-fed from the same woman. The phrase commonly refers to heterosexual male friends who are often mistaken for a homosexual couple."
  },
  {
    "Term": "Bottom",
    "Definition": "1. A sex partner who is submissive to a dominant partner or who is penetrated by the top. 2. Ass."
  },
  {
    "Term": "Bottom Bitch/Girl",
    "Definition": "A pimp’s number one prostitute. Also, the one who lures other women into the lifestyle."
  },
  {
    "Term": "Bottom Space",
    "Definition": "The mental space of a submissive partner in fetish play."
  },
  {
    "Term": "Bottom Surgery",
    "Definition": "Sexual-reassignment surgery, SRS, that involves the reconstruction of a person's genitals to more accurately reflect the genitals of the sex they identify with. This is different from top surgery, which is only the conversion of a transsexual's chest."
  },
  {
    "Term": "Brazilian, Brazilian Bikini Wax",
    "Definition": "In general, any bikini wax in which hair is removed from the asshole. Specifically, this usually refers to a bikini wax in which a vertical stripe of short hair is left extending up from the vagina. Synonyms: landing strip, paintbrush."
  },
  {
    "Term": "Breasts",
    "Definition": "Synonyms: apples, assets, babaloos, balcony, bazongas, bee stings, bongos, boobs, bosom, bouncers, bra stuffers, breasticles, bristols, bumpers, bust, butter bags, cantaloupes, chest, chesticles, chitty chitty bang bangs, cleavage, cock muffs/warmers, coconuts, cupcakes, dirty pillows, dual airbags, flesh bombs, flotation devices, fun bags, gazongas, the girls, globes, grapefruits, flapjacks, flesh bombs, hand warmers, hangers, headlights, head rests, high beams, hills, honkers, hood ornaments, hooters, hot dog buns, howitzers, humps, itty bitty titties, jolly jigglers, jugs, jumbos, kaboobers, kazongas, knobs, knockers, lactoids, the ladies, lemons, loaves, love bubbles/muffins, lungs, mammaries, mammary glands, mammies, mangoes, man pacifiers, mangos, meatballs, meat loaves/puppets, melons, milk bags/duds/jugs/makers, milkers, milkshakes, mosquito bites, mounds, money makers, muffins, niblets, nose warmers, nubbies, nubs, oranges, orbs, ottomans, pancakes, paper weights, peaches, pears, personalities, pillows, pumpkins, puppies, rack, rib bumpers, rib cushions, roundies, sandbags, sauce shelf, scones, shimmies, snuggle pups, speed bags, spheres, spuds, stacks, stuffing, sugar lumps, sun deck, sweater meat, sweet rolls, ta tas, teats, tee tees, tetons, Thelma and Louise, tidbits, tits, titties, tooters, torpedoes, Tweedledee and Tweedledum, twin peaks, twins, udders, umlauts, upper decks, warheads, watermelons, whoppers, window washers, wobblers, zeppelins…"
  },
  {
    "Term": "Breast Expansion",
    "Definition": "A growth fetish often related to fetishes for weight gain or inflation. Enthusiasts enjoy watching breasts increase in size, often by means of animation or by saline injections."
  },
  {
    "Term": "Breast Implants",
    "Definition": "Synonyms: boob job, breast augmentation, breast enhancement, flotation devices, implants, stress balls..."
  },
  {
    "Term": "Breast Man",
    "Definition": "A guy who's obsession with breasts goes far beyond that of the average male."
  },
  {
    "Term": "Breeder",
    "Definition": "1. Heterosexual. 2. A fertile sex partner, particularly one you would want to have children with due to his/her superior genetics. 3. A person with many offspring."
  },
  {
    "Term": "Bridesmaid",
    "Definition": "Women who are enlisted as slaves for the bride-to-be."
  },
  {
    "Term": "Bromance",
    "Definition": "The budding friendship between two heterosexual men."
  },
  {
    "Term": "Bros before Hoes",
    "Definition": "A colloquialism expressing the idea that the interests of your guy friends should come before the needs of the woman you are currently having sex with."
  },
  {
    "Term": "Brothel",
    "Definition": "Synonyms: birdcage, bordello, cathouse, fish market, flesh market, fucktory, girlery, house of ill repute, ladies college, nunnery, poontang plantation, red-light house, whorehouse."
  },
  {
    "Term": "Brown Bag",
    "Definition": "A condom after anal sex."
  },
  {
    "Term": "Brown Bagger, Brown Bag Special",
    "Definition": "A person who you would only have sex with if she wore a bag over her head to hide her hideous face or to discourage her from talking. Synonym: Butter face."
  },
  {
    "Term": "Brownnoser",
    "Definition": "Sycophant. Synonyms: ass licker, ass muncher, bootlicker, brownnoser, kiss ass, toady."
  },
  {
    "Term": "Brown Out",
    "Definition": "A state of drunkenness one level below a blackout. One can only recall the events of a brown out after someone else mentions them."
  },
  {
    "Term": "Bug Chasing",
    "Definition": "Actively trying to acquire the HIV virus by having sex with HIV positive partners, usually for the thrill of such a taboo encounter."
  },
  {
    "Term": "Bugger",
    "Definition": "Anal sex or bestiality. In the UK the term is similar to sodomy in that it is a catchall for deviant sex."
  },
  {
    "Term": "Bugger Off",
    "Definition": "Fuck off."
  },
  {
    "Term": "Bull Shit",
    "Definition": "So much metaphorical shit that it may as well have come from a bull."
  },
  {
    "Term": "Bum Chum",
    "Definition": "A gay friend, or gay fuck buddy."
  },
  {
    "Term": "Burlesque",
    "Definition": "An artful strip tease often set to music and involving elaborate costumes, stage props, and feathers. Now burlesque shows are typically conservative strip teases meant to appeal to other women who have an interest in tattoos and rockabilly culture. Burlesque troops tend to enroll thick, and often heavily tattooed women, who believe they are superior to strippers. Unlike strippers, burlesque performers do not typically make a living off of performing."
  },
  {
    "Term": "Burping Fetish",
    "Definition": "A fetish for watching, hearing, and/or smelling a person burp. Often related to fetishes for farting, feeding, or vore."
  },
  {
    "Term": "Bush",
    "Definition": "A mound of pubic hair."
  },
  {
    "Term": "Butch",
    "Definition": "A lesbian who adopts the dress and mannerisms of a man. She often assumes the more masculine role in a relationship."
  },
  {
    "Term": "Butt Bandit/Pirate",
    "Definition": "A gay man who coerces other men into having sex. Synonyms: ass pirate, ass bandit."
  },
  {
    "Term": "Butt Plug",
    "Definition": "Usually a short, squatty sex toy inserted in an asshole to loosen up the sphincter before anal sex."
  },
  {
    "Term": "Butter Face",
    "Definition": "A woman with an attractive body but an unappealing face. Pronounced, \"but her face,\" as in, \"That woman has a sexy body but her face looks like a donkey's.\" Synonym: brown bag special, brown bagger."
  },
  {
    "Term": "Butt Floss",
    "Definition": "A thong or G-string."
  },
  {
    "Term": "Butt Fucker",
    "Definition": "Anyone who enjoys anal sex. Usually refers to a gay man."
  },
  {
    "Term": "Butt Slut",
    "Definition": "A promiscuous gay man or woman who prefers anal sex."
  }
]



