{
    "dictionary": [
        {
            "term": "Cad",
            "definition": "A man who aggressively pursues his self interests, particularly when it comes to sex, with little regard for others."
        },
        {
            "term": "Cage Fetish",
            "definition": "A fetish for being confined to a small space. This often manifests as a sub being locked in a cage, box, or a closet."
        },
        {
            "term": "Callipygian",
            "definition": "Possessing a beautifully shaped buttocks."
        },
        {
            "term": "Camel Toe",
            "definition": "A vagina wedgy. Also, the impression of a woman’s vagina as seen through tight pants."
        },
        {
            "term": "Candaulism",
            "definition": "A fetish for showing off your partner, or images of him/her, to others."
        },
        {
            "term": "Catcher",
            "definition": "The receiving partner during anal sex. Usually refers to the bottom in a gay couple."
        },
        {
            "term": "Catheterophila",
            "definition": "A fetish for having catheters inserted."
        },
        {
            "term": "Castration",
            "definition": "The removal of the testicles or ovaries, often to prevent fertility and/or to reduce the effects the hormones produced by these glands have on behavior."
        },
        {
            "term": "Cat O' Nine Tails",
            "definition": "A multi-tailed whip, often used in fetish play."
        },
        {
            "term": "Caverject",
            "definition": "The brand name for an injectable drug used to stimulate an erection."
        },
        {
            "term": "Champagne Room",
            "definition": "A private room in a strip club that can be rented out for extended periods of time."
        },
        {
            "term": "Charity",
            "definition": "Engaging in sexual activity with someone who will get far more out of the experience than you will."
        },
        {
            "term": "Chastity Belt",
            "definition": "A medieval device that forcibly guards a woman's virginity."
        },
        {
            "term": "Chesticles",
            "definition": "Boobs."
        },
        {
            "term": "Cherry",
            "definition": "A woman’s virginity. More specifically, the hymen, which is often ruptured during vaginal penetration."
        }
    ]
}
