{
    "dictionary": [
        {
            "term": "Face Job/Fucking",
            "definition": "Thrusting a penis into a partner during fellatio as if the mouth were a more accommodating orifice. This act often provokes an excess of saliva and involuntary tears."
        },
        {
            "term": "Facial",
            "definition": "When a man ejaculates on his partner’s face. Synonym: money shot."
        },
        {
            "term": "Factory Equipped",
            "definition": "A pre-op transsexual who still has all of his/her original parts."
        },
        {
            "term": "Fag, Faggot, Fagot",
            "definition": "1. A gay man. 2. A cigarette. Origins: Once referred to a bundle of sticks used for fuel."
        },
        {
            "term": "Fag Hag",
            "definition": "A woman who hangs out with attractive gay men as a means of boosting her self-confidence. Synonym: fruit fly."
        },
        {
            "term": "Fag Fucker",
            "definition": "A man who has gay sex but who claims he is heterosexual."
        },
        {
            "term": "Fagulus",
            "definition": "Fabulously gay."
        },
        {
            "term": "Fangirl, Fanboy",
            "definition": "A person who is obsessed with a celebrity or fictional character to the point that their fascination becomes a fetish."
        },
        {
            "term": "Farticles",
            "definition": "Poo particles that explode into the air during a fart."
        },
        {
            "term": "Fascinus, fascinum",
            "definition": "In ancient Roman religion, the embodiment of the dick deity or a phallic charm/ amulet."
        },
        {
            "term": "Fat Admirer/Fetish",
            "definition": "A fetish for obesity. A broad category for several sub-fetishes: padding, inflation, stuffing, gaining, immobility, feederism, feedism, feeding fetish."
        },
        {
            "term": "Fat Ass, Fatty",
            "definition": "full blown fatty, heifer, hog, pig, plumper, whale."
        },
        {
            "term": "Father Complex",
            "definition": "Most commonly refers to when a woman is attracted to older, sugar-daddy types in part because she lacked a father figure who provided for her as a child. Synonyms: daddy issues."
        },
        {
            "term": "FBE",
            "definition": "\"Full blown erection.\" Origins: The TV show, Guy Code."
        },
        {
            "term": "Feederism, Feedism, Feeding Fetish, Forced Feeding",
            "definition": "A fat fetish in which pleasure is derived from feeding oneself, or another, with the intention of increasing a person's size."
        },
        {
            "term": "Felch, Feltch",
            "definition": "To suck or lick semen out of an orifice."
        },
        {
            "term": "Fellatio",
            "definition": "Oral sex performed on a penis. Synonyms: BJ, blow, blowie, blow job, bob on the knob, cock sucking, go down on, etc."
        },
        {
            "term": "Female Muscle Fetish",
            "definition": "A fetish for muscular females. This often stems from a sub's desire to be dominated and emasculated by a physically superior female."
        },
        {
            "term": "Foot Fetish",
            "definition": "Being sexually aroused by feet, to the point where you want to stick feet in your mouth and rub your genitals on them."
        },
        {
            "term": "Frotteurism",
            "definition": "A fetish for rubbing against an unsuspecting, and non-consenting, person. Often performed on trains, buses, or in crowds."
        },
        {
            "term": "Futanari",
            "definition": "The Japanese word for hermaphrodite, meaning literally, \"dual forms.\" In hentai anime, futanari characters are women equipped with large penises."
        }
    ]
}
