{
    "dictionary": [
        {
            "term": "Gag",
            "definition": "Any object used to obstruct a person's breathing or to prevent them from talking, especially during sex. A common sex toy in BDSM play."
        },
        {
            "term": "Gagging",
            "definition": "Most often refers to a partner choking during fellatio and deep throating."
        },
        {
            "term": "Gag Gift",
            "definition": "1. When a man unexpectedly forces his penis into his partner's throat during fellatio. 2. An unexpectedly large penis."
        },
        {
            "term": "Gag Reflex",
            "definition": "The involuntary reaction by throat muscles to expel anything lodged in the wind pipe. In terms of sex, this is often activated during rough fellatio."
        },
        {
            "term": "Gaining",
            "definition": "A fat fetish in which pleasure is derived from the idea of oneself, or another, gaining weight. Related to: feederism, feeding, feedism, inflation, immobility, padding."
        },
        {
            "term": "Gallantry",
            "definition": "Respectful behavior or manners exhibited by men toward women."
        },
        {
            "term": "Gangbang",
            "definition": "An orgy in which multiple men have sex with one woman."
        },
        {
            "term": "Ganymede",
            "definition": "A young, boyish homosexual man. Origins: In Greek mythology, Ganymede was kidnapped by Zeus to be a sex slave for the Gods."
        },
        {
            "term": "Gay",
            "definition": "1. Homosexual. Specifically, a homosexual man."
        },
        {
            "term": "Gaydar",
            "definition": "An ability to distinguish homosexuals from heterosexuals."
        },
        {
            "term": "Gift Giver",
            "definition": "A person who infects others with HIV."
        },
        {
            "term": "GILF",
            "definition": "“Grandma I’d like to fuck.” A category in porn."
        },
        {
            "term": "Glory Hole",
            "definition": "A hole in the wall of a bathroom stall through which men stick their dicks to receive anonymous fellatio."
        },
        {
            "term": "Golden Shower",
            "definition": "Urinating on your partner."
        },
        {
            "term": "Gymnophilia",
            "definition": "A fetish for nudity."
        },
        {
            "term": "Gynecomania",
            "definition": "A manic sexual desire for women. Synonyms: satyriasis."
        }
    ]
}
