{
    "dictionary": [
        {
            "term": "Haematomania/Hematolagnia",
            "definition": "A fetish for blood."
        },
        {
            "term": "Hag Fag",
            "definition": "A gay man who prefers to be in the company of straight women."
        },
        {
            "term": "Half & Half",
            "definition": "An encounter with a prostitute that incorporates both oral sex and intercourse."
        },
        {
            "term": "Hamartophilia",
            "definition": "A fetish for committing sins, as defined by your religious upbringing. Synonyms: pecattiphilia."
        },
        {
            "term": "Hand Job, HJ",
            "definition": "1. Using one's hands to bring a partner to orgasm. Usually refers to stroking a penis. 2. Masturbation."
        },
        {
            "term": "Harem",
            "definition": "A group of women or men a powerful person keeps at his disposal to service his sexual needs on demand."
        },
        {
            "term": "Hematolagnia",
            "definition": "A fetish for using or drinking blood in a sexual manner."
        },
        {
            "term": "Hooker",
            "definition": "A street walker."
        },
        {
            "term": "Horny",
            "definition": "Sexually aroused. Synonyms: bulging, dripping, estrus, frisky, fuckish, gamy, hot, hot and bothered."
        },
        {
            "term": "Houdini",
            "definition": "An absurd sex act in which the magician starts out penetrating his partner from behind. He then secretly allows an accomplice to take his place without the bottom partner realizing it."
        },
        {
            "term": "Hourglass Figure",
            "definition": "A woman whose bust measurement is nearly identical to her hip measurement, with a substantially smaller waist. Ex. 36-24-36."
        },
        {
            "term": "Humiliation",
            "definition": "A type of fetish play in which the submissive partner is made to feel ashamed or degraded."
        },
        {
            "term": "Hung / Hung like a Horse",
            "definition": "Having a penis large enough to belong to a beast of burden."
        },
        {
            "term": "Hypersexual",
            "definition": "A person with an hyperactive sex drive."
        },
        {
            "term": "Hyphephilia",
            "definition": "A fetish for touching skin, hair, leather, fur, or fabric. Similar to doraphilia."
        }
    ]
}
