{
  "DirtyDictionary": {
    "J": [
      {
        "term": "Jackal",
        "definition": "An opportunistic man who has sex with anyone he can, often through devious means. He often has sex with the friends of the hot girls his alpha friends meet. Also, a man with no moral compass when it comes to sex."
      },
      {
        "term": "Jackass",
        "definition": "Idiot."
      },
      {
        "term": "Jack Off",
        "definitions": [
          "Male masturbation.",
          "A worthless man."
        ],
        "synonyms": ["jerk off"]
      },
      {
        "term": "Jack Hole",
        "definition": "An idiot who is a hybrid of a jackass and an asshole."
      },
      {
        "term": "Jackhammer",
        "definition": "Hard pounding sex that gets the job done through blunt force as opposed to finesse."
      },
      {
        "term": "Jack-in-the-Box",
        "definition": "Penis, particularly one that springs out of pants when a sex partner unzips him."
      },
      {
        "term": "Jack Johnson",
        "definition": "A hand job that is basically a fist fight between a large black dick and small white hands."
      },
      {
        "term": "Jail Bait",
        "definition": "A temptress who is under the legal age of consent. These seductresses often say things like, “I won’t tell anyone,” “I’m mature/experienced for my age,” “My parents will never find out.”"
      },
      {
        "term": "Jalapeño Finger Poppers",
        "definition": "Pleasing someone with your fingers directly after handling jalapenos, causing various erogenous zones to experience a mild chemical burn."
      },
      {
        "term": "Jam Out With Your Clam Out",
        "definition": "The female equivalent of \"rock out with your cock out.\" The battle cry for uninhibited partying that will most likely lead to sex."
      },
      {
        "term": "Janitor",
        "definition": "A wingman who has sex with the ugly friend in a group of women so that his friend(s) can get the ugly girl’s attractive friend(s) alone.",
        "notes": "So named because a janitor takes out the trash. Although the term sounds derogatory, the janitor serves a vital function, much like real janitors."
      },
      {
        "term": "Jawbreaker",
        "definition": "A large penis."
      },
      {
        "term": "Jelly Belly",
        "definition": "Ejaculating on a partner’s stomach."
      },
      {
        "term": "Jerk Off",
        "definitions": [
          "Male masturbation.",
          "A worthless man."
        ],
        "synonyms": ["jack off"]
      },
      {
        "term": "Jersey Turnpike",
        "definition": "An absurd sex act in which you stick a finger in your partner’s ass, then stick that finger in your partner’s mouth. If you later forget to wash your hands and put that finger anywhere near your face, the mistake is referred to as “Taking the Newark Exit.”"
      },
      {
        "term": "Jizz",
        "definitions": [
          "Semen.",
          "The act of ejaculating."
        ]
      },
      {
        "term": "Jizz Whistle",
        "definition": "Penis."
      },
      {
        "term": "JO",
        "definition": "\"Jerk off.\" Used in personal ads or porns. Usually indicates a desire to engage in simultaneous masturbation."
      },
      {
        "term": "John",
        "definition": "A prostitute's customer."
      },
      {
        "term": "Johnny Bench Called",
        "definition": "An abbreviation of the statement, “Johnny Bench Called and he want his catcher’s mitt back.” A way of saying a woman has an old, worn out vagina, comparable to the catcher’s mitt of one of the greatest baseball catchers of all time."
      },
      {
        "term": "Joined at the Dick",
        "definition": "Two heterosexual men who spend as much time together as a romantic couple."
      },
      {
        "term": "Joined at the Groin",
        "definition": "Sex."
      },
      {
        "term": "Joy Juice",
        "definition": "Natural female lubrication."
      },
      {
        "term": "Jumping on the Grenade",
        "definition": "When a wingman sacrifices his penis by having sex with an ugly woman so that his friend(s) may have sex with the grenade’s attractive friend(s).",
        "synonyms": ["Disarming the Bomb"]
      },
      {
        "term": "Jump Start",
        "definition": "To wake a partner or to get them in the mood for sex with foreplay."
      },
      {
        "term": "Jungle Fever",
        "definition": "A sexual appetite for a member of another race. Often refers to a white person’s preference for African Americans."
      },
      {
        "term": "Junk in the Trunk",
        "definition": "Large ass."
      },
      {
        "term": "Just the Tip",
        "definition": "Gateway foreplay that leads to intercourse. This occurs when a partner is hesitant about being penetrated, especially without a condom. The eager male promises just to put the tip of his penis in, just for a moment, just to see how it feels. Full penetration soon follows."
      }
    ]
  }
}
