{
  "DirtyDictionary": {
    "Z": [
      {
        "term": "Zebra",
        "definitions": [
          "A white woman wearing visible black underwear or a bikini. Also, a black woman wearing visible white underwear or a bikini.",
          "A person from Africa of mixed race.",
          "A white or black person who behaves like a member of another race."
        ],
        "synonyms": ["Oreo"]
      },
      {
        "term": "Zelophilia",
        "definition": "A fetish for feeling jealous."
      },
      {
        "term": "Zentai",
        "definition": "A fetish in which participants wear Zentai suits—skintight suits made from thin, stretchy fabric—in order to have anonymous sex with other Zentai enthusiasts, or to participate in some anonymous dry humping."
      },
      {
        "term": "Zepplins",
        "definition": "Fake breasts that are so large and perky that they seem to be filled with helium and capable of transporting their owner through the air. Also known as 'Flesh Zepplins.'"
      },
      {
        "term": "Zero",
        "definition": "Anus."
      },
      {
        "term": "Zipper",
        "definition": "Vagina."
      },
      {
        "term": "Zipper Sparks",
        "definition": "Dry Humping."
      },
      {
        "term": "Zipper Sex/Dinner",
        "definition": "Fellatio with the penis sticking through a man's fly."
      },
      {
        "term": "Z-Job",
        "definition": "An act performed by a gigolo. If you have to ask, you can't handle it.",
        "origins": "The movie, Beerfest."
      },
      {
        "term": "Zombie Mask",
        "definition": "When a man ejaculates in his partner’s eyes, causing her to stumble around the room with her hands out, moaning, temporarily blind, and pissed off."
      },
      {
        "term": "Zoophilia",
        "definition": "A fetish for acting, dressing, and being treated like an animal. May involve walking on all fours, wearing a collar, and eating out of pet bowls."
      },
      {
        "term": "Zoosexual",
        "definition": "One who has a sexual preference for animals."
      },
      {
        "term": "Zwischenstufe",
        "definition": "Homosexuality. Being aroused by members of the same sex."
      }
    ]
  }
}
